tutorials/steadyStateForcedConvection4NFFoam/turbulatorMonoNEPCMHomogenous/case/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pointSync		false;
writeCyclicMatch	false;

// Patches to create.
patchInfo
(
    {
        name		inlet;
        dictionary
        {
            type	patch;
        }
        constructFrom	patches;
	patches		(auto2);
    }

    {
        name		outlet;
        dictionary
        {
            type	patch;
        }
        constructFrom	patches;
	patches		(auto1);
    }

    {
        name		barrelWall;
        dictionary
        {
            type	wall;
        }
        constructFrom	patches;
	patches		(auto0);
    }

    {
        name screwWall;
        dictionary
        {
            type	wall;
        }
        constructFrom	patches;
	patches		(auto3 auto4 auto5);
    }
);

// ************************************************************************* //
